{
  "_class_name": "LTXPipeline",
  "_diffusers_version": "0.32.0.dev0",
  "scheduler": [
    "diffusers",
    "FlowMatchEulerDiscreteScheduler"
  ],
  "text_encoder": [
    "transformers",
    "T5EncoderModel"
  ],
  "tokenizer": [
    "transformers",
    "T5Tokenizer"
  ],
  "transformer": [
    "diffusers",
    "LTXVideoTransformer3DModel"
  ],
  "vae": [
    "diffusers",
    "AutoencoderKLLTXVideo"
  ]
}
